src/1c_ext/InformationRegisters/mcp_ДинамическиеИнструменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>mcp_ДинамическиеИнструменты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecordSubordinateToRecorder</WriteMode>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СхемаПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/1c_ext/CommonModules/mcp_Выполнение/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет инструмент из таблицы инструментов
//
// Параметры:
//  СтрокаТаблицыИнструментов - СтрокаТаблицыЗначений - строка таблицы инструментов
//  Параметры - Структура - параметры для выполнения инструмента
//
// Возвращаемое значение:
//  Произвольный - результат выполнения инструмента
//
Функция ВыполнитьИнструмент(СтрокаТаблицыИнструментов, Параметры) Экспорт
	
	ИмяОбработки = СтрокаТаблицыИнструментов.ИмяОбработкиКонтейнера;
	ИмяИнструмента = СтрокаТаблицыИнструментов.Имя;
	
	// Динамический инструмент — код хранится в регистре сведений
	Если ИмяОбработки = "_ДинамическийИнструмент" Тогда
		Возврат ВыполнитьДинамическийИнструмент(ИмяИнструмента, Параметры);
	КонецЕсли;
	
	МенеджерОбработки = Обработки[ИмяОбработки];
	
	Возврат МенеджерОбработки.ВыполнитьИнструмент(ИмяИнструмента, Параметры);
	
КонецФункции

// Читает ресурс из таблицы ресурсов
//
// Параметры:
//  СтрокаТаблицыРесурсов - СтрокаТаблицыЗначений - строка таблицы ресурсов
//  Адрес - Строка - адрес ресурса
//
// Возвращаемое значение:
//  Произвольный - содержимое ресурса
//
Функция ПрочитатьРесурс(СтрокаТаблицыРесурсов, Адрес) Экспорт
	
	ИмяОбработки = СтрокаТаблицыРесурсов.ИмяОбработкиКонтейнера;
	
	МенеджерОбработки = Обработки[ИмяОбработки];
	
	Возврат МенеджерОбработки.ПрочитатьРесурс(Адрес);
	
КонецФункции

// Получает промпт из таблицы промптов
//
// Параметры:
//  СтрокаТаблицыПромптов - СтрокаТаблицыЗначений - строка таблицы промптов
//  Имя - Строка - имя промпта
//  Параметры - Структура - параметры для получения промпта
//
// Возвращаемое значение:
//  Произвольный - содержимое промпта
//
Функция ПолучитьПромпт(СтрокаТаблицыПромптов, Имя, Параметры) Экспорт
	
	ИмяОбработки = СтрокаТаблицыПромптов.ИмяОбработкиКонтейнера;
	ИмяПромпта = СтрокаТаблицыПромптов.Имя;
	
	МенеджерОбработки = Обработки[ИмяОбработки];
	
	Возврат МенеджерОбработки.ПолучитьПромпт(ИмяПромпта, Параметры);
	
КонецФункции

// Выполняет динамический инструмент из регистра сведений
//
// Параметры:
//  ИмяИнструмента - Строка - имя инструмента
//  Аргументы - Структура - параметры для выполнения
//
// Возвращаемое значение:
//  Строка - результат выполнения
//
Функция ВыполнитьДинамическийИнструмент(ИмяИнструмента, Аргументы)
	
	// Получаем код из регистра
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДИ.КодВыполнения КАК КодВыполнения
	|ИЗ
	|	РегистрСведений.mcp_ДинамическиеИнструменты КАК ДИ
	|ГДЕ
	|	ДИ.Имя = &Имя";
	Запрос.УстановитьПараметр("Имя", ИмяИнструмента);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВызватьИсключение "Динамический инструмент '" + ИмяИнструмента + "' не найден в регистре";
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	КодВыполнения = Выборка.КодВыполнения;
	Если НЕ ЗначениеЗаполнено(КодВыполнения) Тогда
		ВызватьИсключение "Код выполнения инструмента '" + ИмяИнструмента + "' пуст";
	КонецЕсли;
	
	// Выполняем код. Код получает переменную Аргументы и должен вернуть Результат.
	РезультатВыполнения = "";
	Выполнить(КодВыполнения);
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти
